{
  "welcome": "Welcome to sandeep porfolio!",
  "AppName": "my porfolio",
  "home": {
    "welcome": {
      "title": "Hey, I'm Sandeep",
      "subtitle": "A Web Developer",
      "description": "Step into the realm of endless possibilities, and welcome to my web universe!"
    },
    "header": [
      {
        "id": "1",
        "slideName": "Voice Recognition",
        "slideText": "Voice recognition technology enables hands-free interaction with devices, converting spoken words into text or commands for seamless communication and control."
      },
      {
        "id": "2",
        "slideName": "Multi language Support",
        "slideText": "Multi-language support enhances accessibility, allowing users to engage with content in their preferred language for a more inclusive and user-friendly experience."
      },
      {
        "id": "3",
        "slideName": "Fully Responsive with Animation",
        "slideText": "Fully responsive with animation, our design adapts seamlessly to various devices while incorporating engaging and dynamic visual elements for an enhanced user experience."
      }
    ],
    "intro": {
      "section": {
        "title1": "A Brief",
        "title2": "Introduction"
      },
      "description1": "As a seasoned senior software engineer with more than 5 years of experience, I have honed my expertise in web development, specializing in key technologies like React JS, JavaScript, HTML, and CSS. My commitment to excellence is reflected in a track record of delivering high-quality solutions that seamlessly blend functionality with a visually appealing design. I am deeply passionate about my work, approaching each project with enthusiasm and a results-oriented mindset. My proficiency in React JS enables me to create scalable and efficient user interfaces, while my mastery of JavaScript, HTML, and CSS ensures a holistic and engaging user experience. I thrive in collaborative environments, effectively communicating complex technical concepts and contributing to cross-functional teams. My professional journey underscores adaptability and continuous growth, making me well-equipped to tackle the evolving challenges of web development. I am eager to leverage my skills and passion to contribute to projects that demand cutting-edge solutions and a commitment to excellence.",
      "description":{
        "content1": "With over 5 years of experience as a web developer specializing in React, I have a proven track record of delivering high-quality, user-friendly websites and applications. I possess a deep understanding of frontend development principles and am proficient in building interactive and responsive interfaces using React. My expertise also extends to integrating backend APIs, troubleshooting technical issues, and optimizing website performance to enhance user experience.",
        "content2": "Throughout my career, I have collaborated with cross-functional teams to successfully launch and maintain various web projects, demonstrating strong communication and problem-solving skills. I am adept at staying current with industry trends and technologies, continuously enhancing my skills and knowledge to deliver cutting-edge solutions. My passion for creating innovative and visually appealing web applications, combined with my extensive experience in React development, makes me a valuable asset in any web development team.",
        "content3": "As an accomplished senior software engineer with over 5 years of expertise, my portfolio serves as a testament to a distinguished career marked by a focus on key technologies and a commitment to excellence in web development. Specializing in prominent frameworks such as React JS, I demonstrate a proficiency in creating scalable and visually compelling user interfaces that elevate the overall user experience.",
        "content4": "My professional journey reflects a passion for innovation, with a consistent track record of delivering high-quality solutions that seamlessly integrate functionality and aesthetics. With a keen eye for detail, I ensure that each project showcases not only technical prowess but also a commitment to user-centric design principles.",
        "content5": "In addition to my technical acumen, I bring a collaborative spirit to the table, effectively communicating intricate technical concepts and contributing seamlessly to cross-functional teams. My portfolio encapsulates a diverse range of projects, each highlighting adaptability, continuous growth, and a forward-thinking approach to address the dynamic challenges of web development.",
        "content6": "Emphasizing a results-oriented mindset, I am enthusiastic about leveraging my skills to contribute to projects that demand cutting-edge solutions and a dedication to achieving excellence in the ever-evolving landscape of web development. Explore my portfolio to witness a synthesis of technical expertise, creative finesse, and a passion for pushing the boundaries of what is achievable in web development."
      },
      "description2": "Experienced senior software engineer with over 5 years in web development, specializing in front-end technologies such as React JS, JavaScript, HTML, and CSS. Committed to delivering high-quality solutions, I bring a passion for innovation and a keen eye for detail to every project. My proficiency in crafting dynamic and responsive user interfaces, coupled with effective collaboration skills, positions me as a valuable asset for teams seeking a seasoned professional dedicated to excellence in web development.",
      "knowMore": "Know more"
    },
    "skills":[
      {
        "id": "1",
        "title": "Frontend Expertise",
        "des": "Skilled in HTML, CSS, and JavaScript, with proficiency in modern frameworks like React JS and Angular."
      },
      {
        "id": "2",
        "title": "Responsive Web Design",
        "des": "Creates mobile-friendly websites with CSS frameworks."
      },
      {
        "id": "3",
        "title": "Version Control",
        "des": "Skilled in using version control systems like Git and code management within development teams."
      },
      {
        "id": "4",
        "title": "Performance Optimization",
        "des": "Improves website speed and user experience."
      },
      {
        "id": "5",
        "title": "User Experience (UX) Design",
        "des": "Creates intuitive user interfaces."
      },
      {
        "id": "6",
        "title": "Problem-Solving and Debugging",
        "des": "Troubleshoots and enhances web functionality."
      }
    ],
    "showcase": {
      "section": {
        "title1": "Development",
        "title2": "Services"
      },
      "title11": "I provide custom web development solutions, creating or updating websites to fit your vision. With expertise and dedication, I ensure quality and functionality. Let's transform your online presence!",
      "title1": "I specialize in crafting tailored web solutions, whether you're starting fresh or updating an existing site. My services encompass design, development, and optimization to ensure your website is both stunning and efficient. Let's collaborate to elevate your online presence!",
      "title": "Presenting a comprehensive showcase of prominent features within my portfolio, highlighting key attributes and accomplishments to underscore the depth and breadth of my professional expertise.",
      "title_1": "Through my portfolio, I meticulously present a comprehensive array of distinguished features, strategically emphasizing key attributes and notable achievements. This deliberate approach aims to underscore the extensive depth and breadth of my professional expertise, providing a nuanced and compelling representation of my skills and accomplishments.",
      "features": [
        {
          "id": "1",
          "feature": "Voice Recognition",
          "text": "hands-free experience"
        },
        {
          "id": "2",
          "feature": "Theme Based Portfolio",
          "text": "You will have various colors to choose from"
        },
        {
          "id": "3",
          "feature": "Multi-Lingual Support",
          "text": "Switch between various languages"
        },
        {
          "id": "4",
          "feature": "Cross Browsing Ability",
          "text": "It is compatible with all browsers."
        },
        {
          "id": "5",
          "feature": "Fully Responsive",
          "text": "You will have two distinct options for both web and mobile versions"
        },
        {
          "id": "6",
          "feature": "Sleek Animations",
          "text": "Enjoy the captivating feel of smooth animations"
        }
      ]
    }
  },
  "about": {
    "my": {
      "name": "Sandeep",
      "fullName": "Sandeep Reddy Guduru",
      "designation": "Senior Software Engineer",
      "phone": "9494785839",
      "email": "webdev.sandeep.g@gmail.com"
    },
    "aboutMe": {
      "section": {
        "title1": "About",
        "title2": "My Self"
      },
      "description": {
        "content1": "I bring over 5 years of seasoned expertise to web development, focusing on client-side programming. My specialized skills encompass React JS, Redux, Javascript, HTML, CSS, and diverse front-end frameworks. Throughout my professional journey, I have consistently demonstrated a passion for web development, coupled with a dedicated commitment to exceeding client and end-user expectations. My proficiency lies in crafting solutions that not only meet but surpass industry standards. With a strong foundation in React JS and Redux, I possess a keen understanding of modern front-end technologies. My commitment to excellence is evident in the consistent delivery of innovative and user-centric solutions. I take pride in creating web experiences that seamlessly blend functionality with aesthetics. My extensive background reflects a track record of success, establishing me as a reliable and skilled web developer.",
        "content2": "My expertise in client-side programming is distinguished by a profound understanding of cutting-edge technologies, notably React JS, Redux, and various front-end frameworks. This proficiency allows me to develop dynamic, user-centric interfaces that seamlessly integrate with evolving industry standards. Through my skill set, I consistently deliver high-quality solutions that stay at the forefront of web development. I leverage React JS and Redux to craft innovative and responsive applications, ensuring a seamless user experience. My commitment to staying abreast of emerging technologies underscores my dedication to providing state-of-the-art solutions. This technical acumen, honed over years of experience, positions me as a reliable and skilled web developer in today's fast-paced digital landscape.",
        "content3": "My professional ethos centers around an enduring passion for web development, fostering a proactive and results-oriented work ethic. This passion serves as a driving force, compelling me to continually seek knowledge and keep my skills current in the ever-evolving technological landscape. I am committed to staying ahead of industry trends, adapting swiftly to emerging technologies, and maintaining a proactive approach in my work. This dedication to growth and adaptation positions me as a dynamic professional with a keen focus on staying at the forefront of the field.",
        "content4": "I excel as a quick and self-directed learner, showcasing a meticulous understanding of project requirements. Active collaboration with Product Management teams is a key strength, combining problem-solving methodologies that blend creativity with technical acumen. My track record underscores a consistent ability to deliver project results on time, highlighting a steadfast commitment to success in every endeavor.",
        "content5": "I excel in dynamic environments, thriving on adaptability and innovation. Throughout my professional journey, I've consistently demonstrated a commitment to on-time project deliverables, showcasing a disciplined approach to project management. My unwavering dedication extends beyond individual tasks to encompass the broader team's success. Adept at navigating dynamic challenges, I bring a proactive mindset to achieve optimal outcomes. My commitment to success is grounded in a balance of flexibility, innovation, and a disciplined work ethic, ensuring project goals are met effectively."
      }
    },
    "experience": {
      "section": {
        "title1": "Work",
        "title2": "Experience"
      },
      "description": "With a distinguished career spanning numerous years, my professional journey reflects a steadfast commitment to excellence in IT industry. Showcasing a proven ability to demonstrate key skills and accomplishments. My extensive experience is marked by a strategic approach to industry-specific actions, fostering collaborative environments, and consistently driving results that align with organizational goals.",
      "organizations": [
        {
          "name": "Current",
          "role": "Senior Software Engineer",
          "duration": "",
          "description": [
            "Senior Software Engineer for Workspace.ai project",
            "Advanced skills in React JS and JavaScript development",
            "Collaborated with Product Managers to better understand project requirements",
            "Worked closely with the React Native team to integrate features as per specifications",
            "Responsible for end-to-end client-side handling, ensuring a seamless user experience",
            "Actively shared knowledge to create a friendly and collaborative work environment",
            "Provided support to other projects within the company, demonstrating a holistic approach to teamwork"
          ]
        },

        {
          "name": "Zyclyx",
          "role": "Web Developer",
          "duration": "2018 - 2020",
          "description": [
            "Contributed to RPA projects based in Riyadh, Qatar",
            "Held the role of Web Developer, starting with WordPress management for the company's website and hosting",
            "Engaged in the entire software development lifecycle",
            "Designed screens for optimal user experience (UX) and managed web designing aspects of the user interface (UI)",
            "Implemented functionalities using React JS and JavaScript",
            "Orchestrated site deployments and maintained daily communication with hosting services for Zyclyx and Intellix",
            "Acknowledged the guidance and support of Chenna Reddy and MD. Mirza in professional development"
          ]
        },
        {
          "name": "Polyglot IT Solutions",
          "role": "Software Associate",
          "duration": "",
          "description": [
            "Embarked on my professional journey with the first company",
            "Applied learned courses in HTML, CSS, and JS to practical projects",
            "Designed UX screens for the company's applications",
            "Seized the opportunity as a Software Associate to contribute comprehensively",
            "Grateful for the mentorship and guidance of M.D. Sathish Babu, whose support was instrumental in my professional growth"
          ]
        }
      ]
    },
    "technologies": {
      "section": {
        "title1": "Technical",
        "title2": "Stack"
      },
      "description": "I bring an advanced level of proficiency across a spectrum of technologies, showcasing a steadfast commitment to staying ahead of industry advancements. This comprehensive skill set positions me to make impactful contributions to projects while maintaining alignment with the latest industry standards.",
      "courses": [
        { "name": "React JS", "type": "react" },
        { "name": "REDUX", "type": "redux" },
        { "name": "JavaScript", "type": "javascript" },
        { "name": "HTML", "type": "html" },
        { "name": "CSS", "type": "css" },
        { "name": "SCSS", "type": "scss" },
        { "name": "Bootstrap", "type": "bootstrap" },
        { "name": "Framer Motion", "type": "framermotion" }
      ]
    },
    "workTogether": {
      "contactPage": "Visit contact page",
      "section": {
        "lets": "Let's",
        "work": "Work",
        "together": "Together"
      },
      "subtext": "I'm always looking for new and exciting projects to work on. Let's connect and discuss potential collaborations or any inquiries you may have.",
      "description": "I extend an invitation to connect and discuss potential collaborations or any inquiries you may have. Your interest is valued, and I am enthusiastic about the opportunity to explore ways in which we can work together to achieve shared success. Please feel free to reach out at your earliest convenience."
    }
  },
  "lab": {
    "header": {
      "title": "'Specifications'",
      "description": ""
    },
    "voiceRecognition": {
      "section": {
        "title1": "Voice",
        "title2": "Recognition"
      },
      "description": "JavaScript's voice recognition feature revolutionizes user interaction on websites by allowing seamless communication through spoken words. Developers find it straightforward to integrate this capability into their projects, using simple code to enable a responsive and hands-free user experience. Whether it's navigating through a website, controlling smart home devices, or conducting searches, the versatility of JS voice recognition enhances the overall interactivity, making web applications more intuitive and engaging for users. This innovative feature not only simplifies user input but also opens up a realm of possibilities for creative and interactive web development."
    },
    "themes": {
      "section": {
        "title": "Themes"
      },
      "description1": "Currently, our platform features a meticulously crafted light and dark mode for enhanced user experience. We are diligently working on introducing additional themes to further diversify the aesthetic options available. Stay tuned for upcoming updates as we strive to provide a comprehensive selection of themes to cater to your preferences. Your satisfaction is our priority, and we appreciate your patience as we continue to enhance your visual experience on our platform.",
      "description": {
        "content1": "I am pleased to share that I have successfully implemented both light and dark modes on my platform, ensuring a visually pleasing and personalized experience for users. Currently, these two themes have been carefully crafted to prioritize readability, user comfort, and an aesthetically pleasing interface. However, I want to assure you that this is just the beginning.",
        "content2": "In the pipeline are plans to introduce a variety of additional themes that reflect my dedication to offering a diverse range of visual styles. Your preferences matter, and I am committed to providing you with the flexibility to customize your experience according to your individual taste. I appreciate your patience as I work diligently to enhance and expand the visual aspects of my platform. Stay tuned for updates, as your feedback and satisfaction are integral to my continuous improvement."
      }
    },
    "multiLangual": {
      "section": {
        "title1": "Multi",
        "title2": "Lingual"
      },
      "description": {
        "content1": "I am pleased to announce the successful implementation of multi-language support on my platform, featuring Telugu, Hindi, and English languages. This enhancement is designed to cater to a diverse user base and ensure a more inclusive and accessible experience. As part of our commitment to linguistic diversity, I am actively working on introducing support for additional languages, with a focus on incorporating all popular languages in India.",
        "content2": "Our goal is to create an environment where users can seamlessly engage with the platform in their preferred language, fostering a more personalized and user-friendly experience. Your feedback is invaluable as we continue to expand language options, and we appreciate your patience as we work towards making the platform accessible to a broader audience. Stay tuned for further updates as we strive to meet the diverse linguistic needs of our users."
      }
    },
    "crossBrowser": {
      "section": {
        "title1": "Cross Browser",
        "title2": "Support"
      },
      "description": {
        "content1": "My portfolio is meticulously crafted to ensure cross-browser compatibility, seamlessly running on popular browsers such as Chrome, Safari, Mozilla, IE, and Edge. This dedication to broad browser support is integral to providing a consistent and accessible user experience across different platforms.",
        "content2": "In addition to cross-browser compatibility, I leverage advanced CSS preprocessors to automatically incorporate vendor prefixes. This ensures that the styling of my portfolio remains uniform and visually appealing across various browsers, minimizing any potential discrepancies. This commitment to technical excellence and compatibility reflects my dedication to delivering a polished and professional portfolio accessible to users regardless of their browser preferences."
      }
    },
    "responsive": {
      "section": {
        "title1": "Fully",
        "title2": "Resposive"
      },
      "description": {
        "content": "My portfolio is meticulously designed to be fully responsive, seamlessly adapting to screens of various sizes. Whether you access it on a desktop, tablet, or mobile device, the user experience remains consistent and optimized. When viewed on mobile devices, you'll notice an interface that emulates the intuitive feel of a mobile app. This responsive design ensures a seamless transition between web and mobile environments, providing users with a cohesive and engaging experience across different devices. Whether you access it through a web browser or on your mobile device, the portfolio is crafted to deliver a user-friendly and app-like experience."
      }
    },
    "animations": {
      "section": {
        "title1": "Smooth",
        "title2": "Animations"
      },
      "description": {
        "content1": "In response to the dynamic preferences of today's users, my portfolio has seamlessly integrated cutting-edge animations and micro-interactions. This strategic inclusion elevates the user experience, transforming the interface into an engaging and app-like environment. The deliberate integration of these dynamic features serves the dual purpose of visually captivating users and providing a responsive interaction that enhances the overall aesthetic appeal of the portfolio.",
        "content2": "The carefully crafted animations embedded within the portfolio not only demonstrate a commitment to contemporary design trends but also play a pivotal role in ensuring a seamless and enjoyable user journey. The interface is a harmonious blend of innovation and accessibility, making the overall experience both visually stunning and user-friendly. As users navigate through the portfolio, they are met with a captivating fusion of modern design elements that contribute to an immersive and interactive digital encounter."
      }
    }
  },
  "footer":{
    "rights": "All rights reserved by",
    "contactDetails": {
      "title": "Ready to turn your ideas into reality? Reach me out and let's start building together!",
      "description": "I'm a passionate web developer, and i am an urban photographer, i like to travel in to the nature and also i use surfing in internet for coding tips",
      "call": "Call",
      "message": "Message",
      "social":[
        {"type": "linkedin", "name": "LinkedIn", "link": "https://www.linkedin.com/in/sandeep-reddy-guduru-4b6a98178/", "icon": "<svg width='1000' height='1000' viewBox='0 0 41 41' shape-rendering='crispEdges'><path fill='#FFFFFF' d='M0 0h41v41H0z'/><path stroke='#000000' d='M4 4.5h7m1 0h1m1 0h2m4 0h1m1 0h4m1 0h1m2 0h7M4 5.5h1m5 0h1m1 0h1m3 0h1m1 0h1m1 0h2m2 0h1m1 0h2m2 0h1m5 0h1M4 6.5h1m1 0h3m1 0h1m2 0h1m2 0h5m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h3m1 0h1M4 7.5h1m1 0h3m1 0h1m1 0h1m1 0h2m3 0h1m1 0h3m2 0h3m1 0h1m1 0h3m1 0h1M4 8.5h1m1 0h3m1 0h1m2 0h1m1 0h1m4 0h2m1 0h1m1 0h2m1 0h1m1 0h1m1 0h3m1 0h1M4 9.5h1m5 0h1m2 0h1m3 0h1m1 0h3m1 0h1m2 0h1m1 0h1m1 0h1m5 0h1M4 10.5h7m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h7M12 11.5h1m2 0h2m2 0h5m2 0h3M4 12.5h1m1 0h2m1 0h3m1 0h3m2 0h2m1 0h3m1 0h1m4 0h1m2 0h1m1 0h2M4 13.5h5m7 0h2m2 0h1m1 0h2m1 0h1m1 0h1m2 0h2m1 0h2m1 0h1M6 14.5h3m1 0h3m4 0h1m2 0h2m2 0h1m1 0h2m1 0h5m1 0h2M8 15.5h2m1 0h2m1 0h1m4 0h1m4 0h1m2 0h3m1 0h1m1 0h1M4 16.5h1m2 0h8m1 0h1m1 0h1m2 0h4m1 0h2m1 0h1m1 0h3m1 0h1M4 17.5h1m1 0h1m1 0h1m2 0h2m1 0h1m1 0h3m3 0h5m1 0h1m2 0h1m3 0h1M6 18.5h2m1 0h4m4 0h1m2 0h4m1 0h1m2 0h1m1 0h4M7 19.5h2m2 0h6m1 0h3m2 0h1m1 0h1m1 0h1m1 0h2m2 0h2M4 20.5h8m4 0h1m2 0h1m2 0h1m1 0h4m1 0h2m1 0h1m1 0h1M5 21.5h1m1 0h1m1 0h1m4 0h3m1 0h3m3 0h1m1 0h2m2 0h1m1 0h2m1 0h2M4 22.5h2m4 0h5m1 0h1m1 0h2m2 0h1m1 0h1m4 0h1m1 0h2m1 0h2M4 23.5h1m1 0h3m3 0h2m1 0h1m1 0h1m1 0h2m1 0h1m1 0h1m3 0h1m1 0h1m1 0h1m3 0h1M5 24.5h1m1 0h1m2 0h1m1 0h1m1 0h1m1 0h5m4 0h1m7 0h2M4 25.5h1m1 0h1m6 0h1m2 0h1m1 0h4m1 0h2m1 0h2m1 0h2m3 0h1m1 0h1M6 26.5h1m1 0h3m1 0h1m1 0h2m1 0h1m3 0h2m1 0h2m1 0h4m1 0h2m1 0h2M5 27.5h1m1 0h3m2 0h2m1 0h1m3 0h1m2 0h3m3 0h1m1 0h1m1 0h1M4 28.5h1m1 0h2m2 0h3m2 0h2m2 0h1m1 0h2m3 0h7m2 0h1M12 29.5h1m3 0h1m1 0h3m2 0h1m4 0h1m3 0h2M4 30.5h7m1 0h1m1 0h1m2 0h1m4 0h2m3 0h2m1 0h1m1 0h1M4 31.5h1m5 0h1m1 0h1m1 0h3m2 0h1m4 0h5m3 0h3m1 0h1M4 32.5h1m1 0h3m1 0h1m3 0h4m1 0h1m1 0h1m3 0h1m1 0h6m1 0h2M4 33.5h1m1 0h3m1 0h1m1 0h2m1 0h1m1 0h1m2 0h2m4 0h3m2 0h1m1 0h2m1 0h1M4 34.5h1m1 0h3m1 0h1m1 0h1m1 0h2m2 0h1m2 0h1m2 0h8m1 0h2M4 35.5h1m5 0h1m3 0h1m1 0h1m1 0h5m3 0h3m2 0h2m3 0h1M4 36.5h7m1 0h2m3 0h2m1 0h3m2 0h1m6 0h3'/></svg>"},
        {"type": "github", "name": "GitHub", "link": "https://github.com/Sandeepreddyguduru", "icon": "<svg width='1000' height='1000' viewBox='0 0 37 37' shape-rendering='crispEdges'><path fill='#FFFFFF' d='M0 0h37v37H0z'/><path stroke='#000000' d='M4 4.5h7m1 0h2m1 0h1m2 0h1m1 0h1m1 0h3m1 0h7M4 5.5h1m5 0h1m1 0h2m1 0h2m4 0h2m1 0h1m1 0h1m5 0h1M4 6.5h1m1 0h3m1 0h1m2 0h1m2 0h5m3 0h1m1 0h1m1 0h3m1 0h1M4 7.5h1m1 0h3m1 0h1m1 0h1m1 0h2m3 0h3m1 0h1m2 0h1m1 0h3m1 0h1M4 8.5h1m1 0h3m1 0h1m3 0h8m1 0h1m2 0h1m1 0h3m1 0h1M4 9.5h1m5 0h1m2 0h1m2 0h1m1 0h1m3 0h3m1 0h1m5 0h1M4 10.5h7m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h7M12 11.5h2m1 0h4m1 0h3m1 0h1M4 12.5h1m1 0h2m1 0h3m2 0h1m1 0h3m2 0h3m2 0h1m2 0h1m1 0h2M5 13.5h1m1 0h1m1 0h1m1 0h2m2 0h2m3 0h1m1 0h3m1 0h3m3 0h1M4 14.5h2m1 0h2m1 0h2m1 0h1m1 0h1m2 0h1m2 0h2m2 0h1m1 0h1m2 0h2M5 15.5h4m2 0h1m1 0h2m1 0h3m3 0h1m2 0h2m1 0h1m3 0h1M6 16.5h1m1 0h3m1 0h3m4 0h1m1 0h1m2 0h1m4 0h2M4 17.5h1m3 0h1m2 0h2m2 0h1m1 0h1m1 0h4m3 0h1m3 0h3M6 18.5h1m1 0h3m3 0h3m1 0h1m4 0h2m1 0h1m3 0h3M5 19.5h4m4 0h2m1 0h2m1 0h2m1 0h7m2 0h1M4 20.5h1m1 0h1m1 0h1m1 0h3m2 0h2m3 0h1m1 0h3m3 0h2m1 0h1M5 21.5h3m1 0h1m3 0h1m1 0h1m1 0h1m1 0h1m2 0h1m4 0h1m1 0h3M4 22.5h1m1 0h3m1 0h1m2 0h1m5 0h4m1 0h1m1 0h3m1 0h1M8 23.5h1m2 0h1m2 0h3m2 0h3m4 0h3m1 0h1M5 24.5h1m2 0h7m1 0h2m2 0h3m1 0h7M12 25.5h1m4 0h2m1 0h1m1 0h1m1 0h1m3 0h5M4 26.5h7m1 0h1m1 0h1m2 0h1m2 0h5m1 0h1m1 0h2m1 0h1M4 27.5h1m5 0h1m1 0h1m1 0h2m4 0h1m1 0h1m1 0h1m3 0h2m1 0h2M4 28.5h1m1 0h3m1 0h1m2 0h1m4 0h1m1 0h2m2 0h5m1 0h1M4 29.5h1m1 0h3m1 0h1m1 0h5m1 0h4m1 0h1m1 0h1m1 0h3m2 0h1M4 30.5h1m1 0h3m1 0h1m1 0h3m2 0h2m1 0h1m1 0h1m1 0h1m2 0h1m2 0h1m1 0h1M4 31.5h1m5 0h1m3 0h1m2 0h4m1 0h1m1 0h2m1 0h1m1 0h1m1 0h1M4 32.5h7m1 0h1m2 0h4m3 0h5m4 0h1'/></svg>"},
        {"type": "naukri", "name": "Naukri", "link": "https://www.naukri.com/mnjuser/profile", "icon": "<svg width='1000' height='1000' viewBox='0 0 37 37' shape-rendering='crispEdges'><path fill='#FFFFFF' d='M0 0h37v37H0z'/><path stroke='#000000' d='M4 4.5h7m3 0h1m2 0h1m2 0h4m2 0h7M4 5.5h1m5 0h1m3 0h1m1 0h1m1 0h4m2 0h1m1 0h1m5 0h1M4 6.5h1m1 0h3m1 0h1m1 0h2m5 0h1m4 0h1m1 0h1m1 0h3m1 0h1M4 7.5h1m1 0h3m1 0h1m1 0h2m1 0h1m1 0h2m2 0h1m1 0h1m2 0h1m1 0h3m1 0h1M4 8.5h1m1 0h3m1 0h1m1 0h3m1 0h1m3 0h5m1 0h1m1 0h3m1 0h1M4 9.5h1m5 0h1m1 0h4m2 0h2m4 0h1m1 0h1m5 0h1M4 10.5h7m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h7M12 11.5h2m1 0h2m1 0h1m1 0h1m2 0h2M4 12.5h1m1 0h5m2 0h1m2 0h1m2 0h1m1 0h1m1 0h1m2 0h5M5 13.5h3m3 0h2m1 0h1m2 0h1m2 0h9m3 0h1M8 14.5h1m1 0h2m1 0h2m1 0h6m2 0h1m1 0h1M4 15.5h1m2 0h1m4 0h1m3 0h2m2 0h1m1 0h2m1 0h3m1 0h1m1 0h1M5 16.5h1m1 0h1m2 0h4m1 0h2m1 0h1m2 0h1m7 0h2M4 17.5h1m1 0h1m2 0h1m3 0h4m3 0h7m1 0h1m3 0h1M4 18.5h1m1 0h2m2 0h4m5 0h1m1 0h2m2 0h1m1 0h1m1 0h2M5 19.5h5m4 0h1m1 0h1m1 0h1m3 0h3m2 0h2m2 0h1M7 20.5h4m2 0h1m2 0h1m2 0h3m1 0h1m3 0h1m1 0h2M4 21.5h3m4 0h1m2 0h2m1 0h2m1 0h1m2 0h1m2 0h3m1 0h1m1 0h1M4 22.5h1m1 0h1m1 0h1m1 0h1m1 0h3m2 0h3m4 0h1m2 0h1m2 0h1M4 23.5h1m2 0h1m1 0h1m2 0h1m1 0h1m2 0h1m1 0h1m7 0h2m2 0h1M4 24.5h1m1 0h1m1 0h3m1 0h1m2 0h1m2 0h4m1 0h6m1 0h3M12 25.5h1m1 0h2m4 0h1m3 0h1m3 0h5M4 26.5h7m2 0h3m3 0h6m1 0h1m1 0h3M4 27.5h1m5 0h1m1 0h1m5 0h1m1 0h1m2 0h2m3 0h1m2 0h2M4 28.5h1m1 0h3m1 0h1m1 0h1m2 0h2m4 0h1m2 0h5m1 0h1M4 29.5h1m1 0h3m1 0h1m1 0h1m3 0h3m3 0h1m1 0h1m2 0h1m1 0h4M4 30.5h1m1 0h3m1 0h1m1 0h3m1 0h1m2 0h1m5 0h7M4 31.5h1m5 0h1m3 0h1m1 0h2m5 0h5m1 0h1m1 0h1M4 32.5h7m1 0h3m2 0h1m1 0h3m1 0h1m2 0h5'/></svg>"},
        {"type": "email", "name": "Email", "link": "mailto:webdev.sandeep.g@gmail.com", "icon": "<svg width='1000' height='1000' viewBox='0 0 41 41' shape-rendering='crispEdges'><path fill='#FFFFFF' d='M0 0h41v41H0z'/><path stroke='#000000' d='M4 4.5h7m2 0h1m2 0h3m1 0h5m2 0h1m2 0h7M4 5.5h1m5 0h1m2 0h1m3 0h5m2 0h1m1 0h1m1 0h1m1 0h1m5 0h1M4 6.5h1m1 0h3m1 0h1m1 0h1m2 0h3m2 0h4m3 0h1m2 0h1m1 0h3m1 0h1M4 7.5h1m1 0h3m1 0h1m1 0h2m1 0h2m1 0h1m1 0h1m3 0h5m1 0h1m1 0h3m1 0h1M4 8.5h1m1 0h3m1 0h1m1 0h1m6 0h1m1 0h2m2 0h1m2 0h1m1 0h1m1 0h3m1 0h1M4 9.5h1m5 0h1m1 0h1m2 0h2m1 0h4m2 0h1m1 0h1m1 0h1m1 0h1m5 0h1M4 10.5h7m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h1m1 0h7M12 11.5h3m3 0h2m5 0h2m1 0h1M4 12.5h1m1 0h5m3 0h1m2 0h1m1 0h1m1 0h1m4 0h3m1 0h5M4 13.5h2m1 0h1m1 0h1m1 0h1m1 0h1m8 0h4m1 0h2m1 0h2m1 0h4M4 14.5h1m2 0h2m1 0h1m1 0h3m4 0h1m2 0h1m2 0h1m2 0h1m3 0h1m1 0h1M7 15.5h2m2 0h3m1 0h2m1 0h3m2 0h4m2 0h2m1 0h5M4 16.5h1m3 0h1m1 0h3m1 0h3m5 0h2m1 0h1m1 0h1m1 0h1m1 0h3m1 0h2M4 17.5h5m2 0h2m2 0h1m1 0h5m2 0h1m1 0h2m2 0h2m1 0h1m1 0h2M4 18.5h2m1 0h2m1 0h9m4 0h1m2 0h1m2 0h3m1 0h1m1 0h1M4 19.5h1m3 0h1m2 0h1m2 0h1m1 0h1m3 0h1m2 0h5m1 0h2m1 0h3M6 20.5h1m1 0h1m1 0h2m1 0h1m2 0h2m3 0h3m2 0h4m1 0h2m3 0h1M4 21.5h6m2 0h1m1 0h1m3 0h1m1 0h4m3 0h1m2 0h2m1 0h2m1 0h1M5 22.5h2m3 0h2m1 0h2m1 0h6m2 0h1m1 0h1m3 0h3m1 0h1M8 23.5h2m1 0h1m2 0h1m1 0h1m1 0h2m1 0h2m1 0h1m3 0h2m1 0h4m1 0h1M4 24.5h2m1 0h2m1 0h1m3 0h4m2 0h1m3 0h6m1 0h3M4 25.5h4m1 0h1m3 0h1m1 0h1m1 0h1m1 0h1m1 0h2m4 0h1m2 0h1m2 0h1m2 0h1M4 26.5h1m1 0h3m1 0h3m1 0h2m3 0h3m2 0h1m1 0h1m1 0h6m1 0h1M4 27.5h1m4 0h1m4 0h1m3 0h2m5 0h5m1 0h1m1 0h2M4 28.5h1m1 0h3m1 0h1m1 0h1m3 0h1m1 0h2m1 0h1m4 0h1m1 0h5m2 0h2M12 29.5h1m1 0h1m1 0h3m1 0h1m1 0h4m2 0h1m3 0h1m1 0h3M4 30.5h7m4 0h2m1 0h3m1 0h1m2 0h1m1 0h2m1 0h1m1 0h1m1 0h1M4 31.5h1m5 0h1m1 0h1m1 0h3m1 0h2m4 0h5m3 0h5M4 32.5h1m1 0h3m1 0h1m1 0h1m2 0h1m2 0h2m2 0h2m1 0h1m2 0h6m1 0h2M4 33.5h1m1 0h3m1 0h1m1 0h1m3 0h2m1 0h3m2 0h6m2 0h3m1 0h1M4 34.5h1m1 0h3m1 0h1m1 0h1m1 0h1m2 0h1m5 0h1m2 0h1m1 0h1m1 0h2m1 0h1M4 35.5h1m5 0h1m2 0h4m3 0h1m2 0h4m2 0h2m1 0h3M4 36.5h7m1 0h1m2 0h1m1 0h1m3 0h1m1 0h1m2 0h3m1 0h2m3 0h1'/></svg>"}
      ],
      "form": {
        "fullName": {
          "label": "Full Name",
          "placeholder": "Enter your full name"
        },
        "email": {
          "label": "Email",
          "placeholder": "Enter your email"
        },
        "phone": {
          "label": "Phone",
          "placeholder": "Enter your phone number"
        },
        "subject": {
          "label": "Subject",
          "placeholder": "Enter your subject"
        },
        "message": {
          "label": "Message",
          "placeholder": "Enter your message"
        },
        "submit": "Submit"
      }
    }
  }
}